In [21]:
import pandas as  pd
import  numpy as np

In [22]:
#to covert 1-d array into  series
a = np.array([1,2,3,4,5])
n  = pd.Series(a)
n

0    1
1    2
2    3
3    4
4    5
dtype: int32

In [23]:
#to convert dict into  series
v = {"id" : 1,"name":"Asha" ,"age" : 32}
m = pd.Series(v)
m

id         1
name    Asha
age       32
dtype: object

In [24]:
#to convert list into  series
b = ["ASHA",56,True]
c = pd.Series(b)
c

0    ASHA
1      56
2    True
dtype: object

In [30]:
#to convert tuple into series 
tuple01 = ("Asha","Mahesh","Rekha","Gita") 
d = pd.Series(tuple01)
d

0      Asha
1    Mahesh
2     Rekha
3      Gita
dtype: object

In [29]:
#to access the  value by the  index
d[1]

'Mahesh'

In [19]:
#to access the  value by the  set element index  label
f = pd.Series(tuple01,index = ["A","M","R","G"])
f["A"]

'Asha'

In [8]:
#to create an empty series
em = pd.Series()
em

Series([], dtype: object)

In [9]:
#careting the series using scalar scalar takes single value with  multiple index
sr=pd.Series(True,index=[0,1,2,3,4,5])
print(sr)

0    True
1    True
2    True
3    True
4    True
5    True
dtype: bool

In [10]:
#it return  all index  of the  series
f.index
#it return shape of the series
f.shape
#it return dimension of the series
f.ndim
#if series value has NaN value then it return True otherwise false
f.hasnans
#it return true if the  series is empty otherwise false
f.empty

False

In [11]:
a=pd.Series([12,34,56,67,78])
b=pd.Series([10.5,20.5,30.5], ["a","b","c"])
a.index
a.values
b.index
b.values
# mention data and  index
s=pd.Series(data = [10.5,20.5,30.5], index =["a","b","c"]) 
s.index

Index(['a', 'b', 'c'], dtype='object')

In [12]:
#dataframe
#creating list  for the dataframe
d = ["Asha","Mahesh","Rekha"]
f = pd.DataFrame()
f

Empty DataFrame
Columns: []
Index: []

In [13]:
#creating dataframe using dictionary
f = {"id":[1,2,3,4,5,6,7,"mukesh"],"name":["Asha","Mahesh","Rekha","Suresh","Sujal","Raj","Kamal","Sikha"]}
dic = pd.DataFrame(f)
dic

       id    name
0       1    Asha
1       2  Mahesh
2       3   Rekha
3       4  Suresh
4       5   Sujal
5       6     Raj
6       7   Kamal
7  mukesh   Sikha

In [14]:
#creating the studentlist using dict
studentlist = {"id": pd.Series([101,102,103,104],index=['a','b','c','d']),"name": pd.Series(["asha","rekha","mahesh","rambha"],index=['a','b','c','d'])}
d  = pd.DataFrame(studentlist)
d

#select the  specific column of thee studentlist
d['id']

#to add the new column
d["eng"] = pd.Series([56,34,66,33],index=['a','b','c','d'])
d["math"] = pd.Series([54,78,55,67],index=['a','b','c','d'])
d["guj"] = pd.Series([45,56,78,55],index=['a','b','c','d'])
d["sci"] = pd.Series([47,55,66,77],index=['a','b','c','d'])
d["s.s"] = pd.Series([56,67,87,88],index=['a','b','c','d'])
d["total"] =  pd.Series(index=['a','b','c','d'])
d["total"] = d["eng"]+d["math"]+d["guj"]+d["sci"]+d["s.s"] 
d["per"] =  pd.Series(index=['a','b','c','d'])
d["per"] = d["total"]/4
d
#to delete a  column
# del d['per']
# d
# c= d.pop('eng')

    id    name  eng  math  guj  sci  s.s  total   per
a  101    asha   56    54   45   47   56    258  64.5
b  102   rekha   34    78   56   55   67    290  72.5
c  103  mahesh   66    55   78   66   87    352  88.0
d  104  rambha   33    67   55   77   88    320  80.0

In [15]:
#to access the specific  row  by the index number
d.iloc[1]
#to access the multiple row
d.iloc[[0,1]]
#to access  the  row by  the range
d.iloc[0:3]
#to access the alternative  row
d.iloc[0: :2]
#to access the  single  column
d.iloc[:,4]
#to access the  multiple column bu range
d.iloc[:,0:8]
#to  select the  multiple column
d.iloc[:,[0,1,7,8]]
#condition
d.iloc[list(d["per"]>80)]

    id    name  eng  math  guj  sci  s.s  total   per
c  103  mahesh   66    55   78   66   87    352  88.0

In [16]:
#to access the  specfic row by the index of label
d.loc['b']
#to access the multiple row
d.loc[['a','b']]
#to  access the multiple row by  the  range
d.loc["a":"c"]
#to access the alternative  row
d.loc["a":"c":2]
#to  select the  multiple column
d.loc[:,["id","name","total","per"]]
#to access the  single  column
d.loc[:,"guj"]
#to access the  multiple column by  the  range
d.loc[:,"id":"per"]
#conditon
d.loc[d["per"]>80]

    id    name  eng  math  guj  sci  s.s  total   per
c  103  mahesh   66    55   78   66   87    352  88.0

In [17]:
#to delete the whole dataframe
c = d.drop
c

<bound method DataFrame.drop of     id    name  eng  math  guj  sci  s.s  total   per
a  101    asha   56    54   45   47   56    258  64.5
b  102   rekha   34    78   56   55   67    290  72.5
c  103  mahesh   66    55   78   66   87    352  88.0
d  104  rambha   33    67   55   77   88    320  80.0>